In [1]:
# In[1]:


import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import glob

In [5]:
# In[59]:


com_str_data = pd.read_csv('C:/Users/om sanyal/Desktop/DATA Analyst/project data analysis/data.csv')
com_str_data.shape

(14204, 12)

In [6]:
# In[60]:


com_str_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [7]:
# In[8]:


# rows  and columns of the dataset 
rows = com_str_data.shape[0]
col= com_str_data.shape[1]
print(f'we have got {rows} and {col} in the  data')

we have got 14204 and 12 in the  data

In [8]:
# In[16]:


com_str_data['Item_Identifier'].nunique()

1559

In [9]:
# In[67]:


com_str_data['Item_Identifier'].value_counts()

Item_Identifier
FDX13    10
NCU29    10
FDP21    10
NCT53    10
NCS29    10
         ..
FDM50     7
NCL42     7
FDM10     7
NCW54     7
FDS22     7
Name: count, Length: 1559, dtype: int64

In [10]:
# In[62]:


#finding the missing values percentage for  each  column 
com_str_data.isnull().sum().div(com_str_data.count()).round(2).reset_index().rename(columns={'index':'column',0:'missing value pct'})

                       column  missing value pct
0             Item_Identifier               0.00
1                 Item_Weight               0.21
2            Item_Fat_Content               0.00
3             Item_Visibility               0.00
4                   Item_Type               0.00
5                    Item_MRP               0.00
6           Outlet_Identifier               0.00
7   Outlet_Establishment_Year               0.00
8                 Outlet_Size               0.39
9        Outlet_Location_Type               0.00
10                Outlet_Type               0.00
11          Item_Outlet_Sales               0.00

In [11]:
# In[65]:


# we have replaced  the  null values with the mode value of the column 
com_str_data.loc[com_str_data['Outlet_Size'].isna()==True,'Outlet_Size']=com_str_data['Outlet_Size'].mode()[0]

In [12]:
# In[69]:


# we have replaced  the  null values with the mean value of the column 
com_str_data.loc[com_str_data['Item_Weight'].isna()==True,'Item_Weight']=com_str_data['Item_Weight'].mean()

In [13]:
# In[19]:


com_str_data['Item_Weight'].value_counts()

Item_Weight
12.792854    2439
17.600000     135
12.150000     127
10.500000     123
13.650000     115
             ...
5.905000        7
7.640000        7
9.035000        6
7.850000        6
4.615000        6
Name: count, Length: 416, dtype: int64

In [14]:
# In[38]:


com_str_data['Item_Type'].unique()

array(['Dairy', 'Soft Drinks', 'Meat', 'Fruits and Vegetables',
       'Household', 'Baking Goods', 'Snack Foods', 'Frozen Foods',
       'Breakfast', 'Health and Hygiene', 'Hard Drinks', 'Canned',
       'Breads', 'Starchy Foods', 'Others', 'Seafood'], dtype=object)

In [15]:
# In[31]:


# for each  item fat content   what are  the item_identifiers  
com_str_data_df = com_str_data.groupby('Item_Fat_Content')['Item_Identifier'].apply(lambda x:','.join(x)).reset_index()
com_str_data_df

  Item_Fat_Content                                    Item_Identifier
0               LF  FDM39,FDC46,DRJ13,FDR47,DRF36,DRK12,FDA39,FDX2...
1          Low Fat  FDA15,FDN15,NCD19,FDP10,FDY07,FDF32,NCB42,DRI1...
2          Regular  DRC01,FDX07,FDP36,FDO10,FDH17,FDU28,FDA03,FDX3...
3          low fat  DRJ59,NCZ18,FDV45,DRE60,FDS52,FDF20,FDW35,FDW2...
4              reg  FDN04,FDR28,FDX49,FDM01,FDN58,FDH28,FDH45,FDS2...

In [16]:
# In[32]:


#for each  item  fat content what are different item types  that will fall into  those
com_str_data_df1 = com_str_data.groupby('Item_Fat_Content')['Item_Type'].apply(lambda x:','.join(x)).reset_index()
com_str_data_df1

  Item_Fat_Content                                          Item_Type
0               LF  Dairy,Snack Foods,Soft Drinks,Breads,Soft Drin...
1          Low Fat  Dairy,Meat,Household,Snack Foods,Fruits and Ve...
2          Regular  Soft Drinks,Fruits and Vegetables,Baking Goods...
3          low fat  Hard Drinks,Household,Snack Foods,Soft Drinks,...
4              reg  Frozen Foods,Frozen Foods,Canned,Breakfast,Sna...

In [17]:
# In[74]:


com_str_data[['Outlet_Identifier','Outlet_Establishment_Year']].value_counts()

Outlet_Identifier  Outlet_Establishment_Year
OUT027             1985                         1559
OUT013             1987                         1553
OUT046             1997                         1550
OUT049             1999                         1550
OUT035             2004                         1550
OUT045             2002                         1548
OUT018             2009                         1546
OUT017             2007                         1543
OUT010             1998                          925
OUT019             1985                          880
Name: count, dtype: int64

In [18]:
# In[84]:


#total item_outlet_sales for different outlet_idetifier 
#top 5 outlet_identifier with  max_sales 
com_str_data_OI = com_str_data.groupby('Outlet_Identifier')['Item_Outlet_Sales'].sum().round(2).reset_index()
com_str_data_OI.sort_values(['Item_Outlet_Sales'], ascending=False).head(5)

  Outlet_Identifier  Item_Outlet_Sales
5            OUT027         5605149.93
6            OUT035         3607244.69
2            OUT017         3517541.40
9            OUT049         3495627.93
1            OUT013         3418605.83

In [19]:
# In[79]:


#which outlet location type giving us more sells 
com_str_data.groupby('Outlet_Location_Type')['Item_Outlet_Sales'].sum().round(2).reset_index()

  Outlet_Location_Type  Item_Outlet_Sales
0               Tier 1         7149739.66
1               Tier 2        10366826.74
2               Tier 3        12302367.06

In [20]:
# In[87]:


# Top 3 outlet_type to have  highest sales  
com_str_data_OT = com_str_data.groupby('Outlet_Type')['Item_Outlet_Sales'].sum().round(2).reset_index()
com_str_data_OT.sort_values(['Item_Outlet_Sales'], ascending=False).head(3)

         Outlet_Type  Item_Outlet_Sales
1  Supermarket Type1        20651869.53
3  Supermarket Type3         5605149.93
2  Supermarket Type2         2979587.36

In [21]:
# In[88]:


com_str_data_IT =  com_str_data.groupby('Item_Type')['Item_Outlet_Sales'].sum().round(2).reset_index()
com_str_data_IT.sort_values(['Item_Outlet_Sales'], ascending=False).head(10)

                Item_Type  Item_Outlet_Sales
6   Fruits and Vegetables         4388855.96
13            Snack Foods         4349839.56
9               Household         3375888.40
5            Frozen Foods         2853719.31
4                   Dairy         2438365.45
3                  Canned         2293210.08
0            Baking Goods         2059889.88
8      Health and Hygiene         1703294.76
10                   Meat         1552021.16
14            Soft Drinks         1453744.45